# Pyber Challenge

### 4.3 Loading and Reading CSV files

In [69]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd
import os

# File to Load (Remember to check these)
city_data_to_load = "../Resources/city_data.csv"
ride_data_to_load = "../Resources/ride_data.csv"

# Read the City and Ride Data
city_data_df = pd.read_csv(city_data_to_load)
ride_data_df = pd.read_csv(ride_data_to_load)

### Merge the DataFrames

In [70]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the data table for preview
pyber_data_df.tail()

,city,date,fare,ride_id,driver_count,type
2370,Michaelberg,2019-04-29 17:04:39,13.38,8550365057598,6,Rural
2371,Lake Latoyabury,2019-01-30 00:05:47,20.76,9018727594352,2,Rural
2372,North Jaime,2019-02-10 21:03:50,11.11,2781339863778,1,Rural
2373,West Heather,2019-05-07 19:22:15,44.94,4256853490277,4,Rural
2374,Newtonview,2019-04-25 10:20:13,55.84,9990581345298,1,Rural

## Challenge Deliverable 1. Generate a Ride-Sharing DataFrame by City Type

In [98]:
#  1. Get the total rides for each city type
# unique is a function that returnsd one of each city 
unique_types=pyber_data_df['type'].unique()

type_count =[ # empty list
]
for t in unique_types:
    # shape[] returns a two tuple.
    df_pyber = (t,pyber_data_df[pyber_data_df['type']==t].shape[0])
    type_count.append(pyber_data_df[pyber_data_df['type']==t].shape[0])
    
# Test of boolean 
# pyber_data_df[pyber_data_df['type']=="Urban"].shape[0])
# pyber_data_df[type']==t

series_index=["a","b","c"]
unique_series={"type": pd.Series(unique_types.tolist(),index=series_index),
              "type_count": pd.Series(type_count,index=series_index)}

summary_df=pd.DataFrame(unique_series).sort_index(0,1,False)
summary_df

/Users/radatus/opt/anaconda3/envs/PythonData/lib/python3.7/site-packages/ipykernel_launcher.py:20: FutureWarning: In a future version of pandas all arguments of DataFrame.sort_index will be keyword-only

       type  type_count
c     Rural         125
b  Suburban         625
a     Urban        1625

In [115]:
# 2. Get the total drivers for each city type
for t in unique_types:
    single_type_df=pyber_data_df[pyber_data_df['type']==t]
    d_tot =[(t,(single_type_df['driver_count'].sum()))]
    tot_drivers_df = pd.DataFrame(d_tot).sort_index(0,1,False)
tot_drivers_df

/Users/radatus/opt/anaconda3/envs/PythonData/lib/python3.7/site-packages/ipykernel_launcher.py:5: FutureWarning: In a future version of pandas all arguments of DataFrame.sort_index will be keyword-only
  """

       0    1
0  Rural  537

In [118]:
#  3. Get the total amount of fares for each city type
for f in unique_types:
    single_type_df=pyber_data_df[pyber_data_df['type']==f]
    print(f,(single_type_df['fare'].sum().round(2)))
    tot_fares_df=pd.DataFrame((f,(single_type_df['fare'].sum().round(2))))
                                                                                 
#     .sort_index(0,1,False)

Urban 39854.38
Suburban 19356.33
Rural 4327.93

In [119]:
#  4. Get the average fare per ride for each city type. 
for a in unique_types:
    fr_ride = single_type_df=pyber_data_df[pyber_data_df['type']==a]
    print(a,(single_type_df['fare'].mean())), fr_ride

Urban 24.52577230769236
Suburban 30.97012800000002
Rural 34.623440000000016

In [172]:
# Create the Rural city DataFrames.

rural_cities_df = pyber_data_df[pyber_data_df["type"] == "Rural"]
rural_cities_df.sum()

city            RandallchesterNorth HollyMichaelbergLake Latoy...
date            2019-04-13 11:13:312019-02-02 14:54:002019-03-...
fare                                                      4327.93
ride_id                                           580968240341287
driver_count                                                  537
type            RuralRuralRuralRuralRuralRuralRuralRuralRuralR...
dtype: object

In [170]:
# Create the Suburban city DataFrames.
suburban_cities_df = pyber_data_df[pyber_data_df["type"] == "Suburban"]
suburban_cities_df.sum()

city            BarronchesterEast KentstadLake OmarMyersshireW...
date            2019-01-27 03:08:012019-04-07 19:44:192019-01-...
fare                                                     19356.33
ride_id                                          3106884522576766
driver_count                                                 8570
type            SuburbanSuburbanSuburbanSuburbanSuburbanSuburb...
dtype: object

In [171]:
# Create the Urban city DataFrame.
urban_cities_df = pyber_data_df[pyber_data_df["type"] == "Urban"]
urban_cities_df.sum()

city            Lake JonathanshireSouth MichelleportPort Saman...
date            2019-01-14 10:14:222019-03-04 18:24:092019-02-...
fare                                                     39854.38
ride_id                                          7919412664056093
driver_count                                                59602
type            UrbanUrbanUrbanUrbanUrbanUrbanUrbanUrbanUrbanU...
dtype: object

In [166]:

ride_fare_df = single_type_df.groupby(by='type')
# ride_fare_df.sum("Rural")
# ride_fare_df.sum("Suburban")
ride_fare_df.sum()
urban_cities_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

In [160]:
# 5. Get the average fare per driver for each city type. 
# for d_a in unique_types:
#     single_type_df=pyber_data_df[pyber_data_df['type']==d_a]
#     print(d_a,(single_type_df['fare']/fr_ride))

In [162]:
#  6. Create a PyBer summary DataFrame. 
pyber_summary_df = summary_df

In [163]:
#  7. Cleaning up the DataFrame. Delete the index name
pyber_summary_df.index.name = None
pyber_summary_df

       type  type_count
c     Rural         125
b  Suburban         625
a     Urban        1625

In [ ]:
#  8. Format the columns.

## Deliverable 2.  Create a multiple line plot that shows the total weekly of the fares for each type of city.

In [164]:
# Print the merged DataFrame for reference.
pyber_data_df

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban
...,...,...,...,...,...,...
2370,Michaelberg,2019-04-29 17:04:39,13.38,8550365057598,6,Rural
2371,Lake Latoyabury,2019-01-30 00:05:47,20.76,9018727594352,2,Rural
2372,North Jaime,2019-02-10 21:03:50,11.11,2781339863778,1,Rural
2373,West Heather,2019-05-07 19:22:15,44.94,4256853490277,4,Rural
2374,Newtonview,2019-04-25 10:20:13,55.84,9990581345298,1,Rural

In [173]:
# 1. Using groupby() to create a new DataFrame showing the sum of the fares 
#  for each date where the indices are the city type and date.
pyber_data_df.groupby

<bound method DataFrame.groupby of                     city                 date   fare        ride_id  \
0     Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1     South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2     Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3             Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4             South Jack  2019-03-06 04:28:35  34.58  3908451377344
...                  ...                  ...    ...            ...
2370         Michaelberg  2019-04-29 17:04:39  13.38  8550365057598
2371     Lake Latoyabury  2019-01-30 00:05:47  20.76  9018727594352
2372         North Jaime  2019-02-10 21:03:50  11.11  2781339863778
2373        West Heather  2019-05-07 19:22:15  44.94  4256853490277
2374          Newtonview  2019-04-25 10:20:13  55.84  9990581345298

      driver_count   type
0                5  Urban
1               72  Urban
2               57  Urban
3               34  Urban
4               46  Urban
...            ...    ...
2370             6  Rural
2371             2  Rural
2372             1  Rural
2373             4  Rural
2374             1  Rural

[2375 rows x 6 columns]>

In [ ]:
# 2. Reset the index on the DataFrame you created in #1. This is needed to use the 'pivot()' function.
# df = df.reset_index()

In [ ]:
# 3. Create a pivot table with the 'date' as the index, the columns ='type', and values='fare' 
# to get the total fares for each type of city by the date.

In [ ]:
# 4. Create a new DataFrame from the pivot table DataFrame using loc on the given dates, '2019-01-01':'2019-04-28'.

In [ ]:
# 5. Set the "date" index to datetime datatype. This is necessary to use the resample() method in Step 8.
# df.index = pd.to_datetime(df.index)

In [ ]:
# 6. Check that the datatype for the index is datetime using df.info()

In [ ]:
# 7. Create a new DataFrame using the "resample()" function by week 'W' and get the sum of the fares for each week.

In [ ]:
# 8. Using the object-oriented interface method, plot the resample DataFrame using the df.plot() function. 

# Import the style from Matplotlib.
from matplotlib import style
# Use the graph style fivethirtyeight.
style.use('fivethirtyeight')